Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གཏི་མུག་ཡོངས་སུ་དག་པས། གཟུགས་ཡོངས་སུ་དག་པ། གཟུགས་ཡོངས་སུ་དག་པས། གཏི་མུག་ཡོངས་སུ་དག་པ་སྟེ།
en: Physical forms are utterly pure owing to the utter purity of delusion, and delusion is utterly pure owing to the utter purity of physical forms.

source: དེ་ལྟར་ན་གཏི་མུག་ཡོངས་སུ་དག་པ་དང་། གཟུགས་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །གཏི་མུག་ཡོངས་སུ་དག་པས།
en: So it is that the utter purity of delusion and this utter purity of physical forms are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་དག་པ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པས། གཏི་མུག་ཡོངས་སུ་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are utterly pure owing to the utter purity of delusion, and delusion is utterly pure owing to the utter purity of all-aspect omniscience [and so forth].

source: དེ་ལྟར་ན་གཏི་མུག་ཡོངས་སུ་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the utter purity of delusion and this utter purity of all-aspect omniscience [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. {Ki.

source: །རབ་འབྱོར་གཞན་ཡང་མ་རིག་པ་རྣམ་པར་དག་པས། འདུ་བྱེད་རྣམ་པར་དག་པ།
en: II-III: 157} “Moreover, Subhūti, formative predispositions are pure owing to the purity of ignorance, and ignorance is pure owing to the purity of formative predispositions.

source: འདུ་བྱེད་རྣམ་པར་དག་པས། མ་རིག་པ་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ནམ་རིག་པ་རྣམ་པར་དག་པ་དང་། འདུ་བྱེད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of ignorance and this purity of formative predispositions are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །འདུ་བྱེད་རྣམ་པར་དག་པས། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ།
en: Consciousness is pure owing to the purity of formative predispositions.

source: རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས། མིང་དང་གཟུགས་རྣམ་པར་དག་པ།
en: Name and form are pure owing to the purity of consciousness.

source: མིང་དང་གཟུགས་རྣམ་པར་དག་པས། སྐྱེ་མཆེད་དྲུག་རྣམ་པར་དག་པ།
en: The six sense fields are pure owing to the purity of name and form.

source: སྐྱེ་མཆེད་དྲུག་རྣམ་པར་དག་པས། རེག་པ་རྣམ་པར་དག་པ།
en: Sensory contact is pure owing to the purity of the six sense fields.

source: རེག་པ་རྣམ་པར་དག་པས། ཚོར་བ་རྣམ་པར་དག་པ།
en: Sensation is pure owing to the purity of sensory contact.

source: ཚོར་བ་རྣམ་པར་དག་པས། སྲེད་པ་རྣམ་པར་དག་པ།
en: Craving is pure owing to the purity of sensation.

source: སྲེད་པ་རྣམ་པར་དག་པས། ལེན་པ་རྣམ་པར་དག་པ།
en: Grasping is pure owing to the purity of craving.

source: ལེན་པ་རྣམ་པར་དག་པས། སྲིད་པ་རྣམ་པར་དག་པ།
en: The rebirth process is pure owing to the purity of grasping.

source: སྲིད་པ་རྣམ་པར་དག་པས། སྐྱེ་བ་རྣམ་པར་དག་པ།
en: Actual birth is pure owing to the purity of the rebirth process.

source: སྐྱེ་བ་རྣམ་པར་དག་པས། རྒ་ཤི་རྣམ་པར་དག་པ།
en: Aging and death are pure owing to the purity of actual birth. [

source: རྒ་ཤི་རྣམ་པར་དག་པས། སྐྱེ་བ་རྣམ་པར་དག་པ་སྟེ།
en: And in reverse], actual birth is pure owing to the purity of aging and death [and so forth].

source: དེ་ལྟར་ན་སྐྱེ་བ་རྣམ་པར་དག་པ་དང་། རྒ་ཤི་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of actual birth [and so forth] and this purity of aging and death [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རྒ་ཤི་རྣམ་པར་དག་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ།
en: The perfection of wisdom is pure owing to the purity of aging and death.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། རྒ་ཤི་རྣམ་པར་དག་པ་སྟེ།
en: Aging and death are pure owing to the purity of the perfection of wisdom.

source: དེ་ལྟར་ན་རྒ་ཤི་རྣམ་པར་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of aging and death and this purity of the perfection of wisdom are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ།
en: The perfection of meditative concentration is pure owing to the purity of the perfection of wisdom.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ།
en: The perfection of perseverance is pure owing to the purity of the perfection of meditative concentration.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ།
en: The perfection of tolerance is pure owing to the purity of the perfection of perseverance.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ།
en: The perfection of ethical discipline is pure owing to the purity of the perfection of tolerance.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ།
en: The perfection of generosity is pure owing to the purity of the perfection of ethical discipline. [

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ།
en: And in reverse], the perfection of ethical discipline is pure owing to the purity of the perfection of generosity [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་པས།
en: So it is that the purity of the perfection of generosity [and so forth] and this purity of the perfection of ethical discipline [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ། ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ།
en: The emptiness of internal phenomena is pure owing to the purity of the perfection of generosity, and the perfection of generosity is pure owing to the purity of the emptiness of internal phenomena.

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པར་དང་། ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། ཕྱི་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ།
en: So it is that the purity of the perfection of generosity [and so forth] and this purity of the emptiness of internal phenomena are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: ཕྱི་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། ཕྱི་ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ།
en: The emptiness of external phenomena is pure owing to the purity of the emptiness of internal phenomena.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པ།
en: The emptiness of external and internal phenomena is pure owing to the purity of the emptiness of external phenomena. [

source: ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are pure owing to the purity of the emptiness of external and internal phenomena [and so forth]. [

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: And in reverse], the emptiness of the essential nature is pure owing to the purity of the emptiness of the essential nature of nonentities.

source: དེ་ལྟར་ན་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the emptiness of the essential nature and this purity of the emptiness of the essential nature of nonentities are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པ།
en: The applications of mindfulness are pure owing to the purity of the emptiness of the essential nature of nonentities.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: The emptiness of the essential nature of nonentities is pure owing to the purity of the applications of mindfulness.

source: དེ་ལྟར་ན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the emptiness of the essential nature of nonentities and this purity of the applications of mindfulness are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པས། ཡང་དག་པར་སྤོང་བ་རྣམ་པར་དག་པ།
en: The correct exertions are pure owing to the purity of the applications of mindfulness.

source: ཡང་དག་པར་སྤོང་བ་རྣམ་པར་དག་པས། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམ་པར་དག་པ།
en: The supports for miraculous ability are pure owing to the purity of the correct exertions.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམ་པར་དག་པས། དབང་པོ་རྣམ་པར་དག་པ།
en: The faculties are pure owing to the purity of the supports for miraculous ability.

source: དབང་པོ་རྣམ་པར་དག་པས། སྟོབས་རྣམ་པར་དག་པ།
en: The powers are pure owing to the purity of the faculties.

source: སྟོབས་རྣམ་པར་དག་པས། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམ་པར་དག་པ།
en: The branches of enlightenment are pure owing to the purity of the powers.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམ་པར་དག་པས། ལམ་རྣམ་པར་དག་པ།
en: The path is pure owing to the purity of the branches of enlightenment. [

source: ལམ་རྣམ་པར་དག་པས། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམ་པར་དག་པ་སྟེ།
en: And in reverse], the branches of enlightenment are pure owing to the purity of the path.

source: དེ་ལྟར་ན་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམ་པར་དག་པ་དང་། ལམ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the branches of enlightenment and this purity of the path are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ལམ་རྣམ་པར་དག་པས། འཕགས་པའི་བདེན་པ་རྣམ་པར་དག་པ།
en: The truths of the noble ones are pure owing to the purity of the path.

source: འཕགས་པའི་བདེན་པ་རྣམ་པར་དག་པས། བསམ་གཏན་རྣམ་པར་དག་པ།
en: The meditative concentrations are pure owing to the purity of the truths of the noble ones.

source: བསམ་གཏན་རྣམ་པར་དག་པས། ཚད་མེད་པ་རྣམ་པར་དག་པ།
en: The immeasurable attitudes are pure owing to the purity of the meditative concentrations.

source: ཚད་མེད་པ་རྣམ་པར་དག་པས། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམ་པར་དག་པ།
en: The formless absorptions are pure owing to the purity of the immeasurable attitudes.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམ་པར་དག་པས། རྣམ་པར་ཐར་པ་བརྒྱད་རྣམ་པར་དག་པ།
en: The eight aspects of liberation are pure owing to the purity of the formless absorptions.

source: རྣམ་པར་ཐར་པ་བརྒྱད་རྣམ་པར་དག་པས། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་རྣམ་པར་དག་པ།
en: The nine serial steps of meditative absorption are pure owing to the purity of the eight aspects of liberation.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམ་པར་དག་པས། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་རྣམ་པར་དག་པ།
en: Emptiness, signlessness, and wishlessness are pure owing to the purity of the serial steps of meditative absorption.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་རྣམ་པར་དག་པས། མངོན་པར་ཤེས་པ་རྣམ་པར་དག་པ།
en: The extrasensory powers are pure owing to the purity of emptiness, signlessness, and wishlessness.

source: མངོན་པར་ཤེས་པ་རྣམ་པར་དག་པས། ཏིང་ངེ་འཛིན་རྣམ་པར་དག་པ།
en: The meditative stabilities are pure owing to the purity of the extrasensory powers.

source: ཏིང་ངེ་འཛིན་རྣམ་པར་དག་པས། གཟུངས་ཀྱི་སྒོ་རྣམ་པར་དག་པ།
en: The dhāraṇī gateways are pure owing to the purity of the meditative stabilities.

source: གཟུངས་ཀྱི་སྒོ་རྣམ་པར་དག་པས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམ་པར་དག་པ།
en: The powers of the tathāgatas are pure owing to the purity of the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམ་པར་དག་པས། མི་འཇིགས་པ་རྣམ་པར་དག་པ།
en: The fearlessnesses are pure owing to the purity of the powers of the tathāgatas.

source: མི་འཇིགས་པ་རྣམ་པར་དག་པས། སོ་སོ་ཡང་དག་ཕར་རིག་པ་རྣམ་པར་དག་པ།
en: The kinds of exact knowledge are pure owing to the purity of the fearlessnesses.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་དག་པས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམ་པར་དག་པ།
en: The distinct qualities of the buddhas are pure owing to the purity of the kinds of exact knowledge.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམ་པར་དག་པས། ཐམས་ཅད་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ།
en: Knowledge of all the dharmas is pure owing to the purity of the distinct qualities of the buddhas. {Ki.

source: ཐམས་ཅད་ཤེས་པ་ཉིད་རྣམ་པར་དག་པས། ལམ་གྱི་རྣམ་པར་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ།
en: II-III: 158} Knowledge of the path is pure owing to the purity of knowledge of all the dharmas.

source: ལམ་གྱི་རྣམ་པར་ཤེས་པ་ཉིད་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ།
en: All-aspect omniscience is pure owing to the purity of knowledge of the path. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: And in reverse], knowledge of the path is pure owing to the purity of all-aspect omniscience.

source: དེ་ལྟར་ན་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of knowledge of the path and this purity of all-aspect omniscience are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Moreover, Subhūti, physical forms are pure owing to the purity of the perfection of wisdom. [

source: གཟུགས་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of physical forms.

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས།
en: So it is that the purity of the perfection of wisdom, the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས།
en: Feelings, perceptions, formative predispositions, and consciousness are pure owing to the purity of the perfection of wisdom. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of consciousness [and so forth].

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of consciousness [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། མིག་རྣམ་པར་དག་པ།
en: The eyes are pure owing to the purity of the perfection of wisdom. [

source: མིག་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of the eyes.

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། མིག་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of the eyes, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་།
en: The ears, nose, tongue, body, and mental faculty are pure owing to the purity of the perfection of wisdom. [

source: ཡིད་རྣམ་པར་དག་པ། ཡིད་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of the mental faculty [and so forth].

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཡིད་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of the mental faculty [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Sights are pure owing to the purity of the perfection of wisdom. [

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of sights, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། སྒྲ་དང་དྲི་དང་། རོ་དང་རེག་དང་ཆོས་རྣམ་པར་དག་པ།
en: Sounds, odors, tastes, tangibles, and mental phenomena are pure owing to the purity of the perfection of wisdom. [

source: ཆོས་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of mental phenomena [and so forth].

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཆོས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of mental phenomena [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། མིག་གི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ།
en: Visual consciousness is pure owing to the purity of the perfection of wisdom. [

source: མིག་གི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of visual consciousness.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས།
en: So it is that the purity of the perfection of wisdom, the purity of visual consciousness, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are pure owing to the purity of the perfection of wisdom. [

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of mental consciousness [and so forth].

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of mental consciousness [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། མིག་གི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པ།
en: Visually compounded sensory contact is pure owing to the purity of the perfection of wisdom. [

source: མིག་གི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of visually compounded sensory contact.

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་ས་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of visually compounded sensory contact, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are pure owing to the purity of the perfection of wisdom. [

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of mentally compounded sensory contact [and so forth].

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ།
en: Feelings conditioned by visually compounded sensory contact are pure owing to the purity of the perfection of wisdom. [

source: མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of feelings conditioned by visually compounded sensory contact.
